
-- *계정 만들기 -------------------------------------------

-- 모든 곳에서 접속 가능
create user 'pos'@'%'identified by 'pos';


-- ----------------------------------------
-- #계정 조회
-- ----------------------------------------
use mysql;

select  user, host
from user
;


-- ----------------------------------------
-- #데이터베이스(스키마) 만들기
-- ----------------------------------------
create database pos_db
    default character set utf8mb4
    collate utf8mb4_general_ci
    default encryption='n'
;


-- ----------------------------------------------
-- #권한부여
-- 'pos'@'%' 계정이 pos_db(데이타베이스)의 모든 테이블에 모든 권한 부여
grant all privileges on pos_db.* to 'pos'@'%';
flush privileges;


show databases;





-- *계정 삭제 ---------------------------------------------
drop user 'web'@'%';
-- ------------------------------------------------------

-- ----------------------------------------
-- #데이터베이스(스키마) 삭제
-- ----------------------------------------
drop database web_db;





